app/controllers/movies_controller.rb

  def index

		if params[:sort].nil? && params[:ratings].nil? &&
			(!session[:sort].nil? || !session[:ratings].nil?)
		  redirect_to movies_path(:sort => session[:sort], :ratings => session[:ratings])
		end
		@ratings = params[:ratings]
		if @ratings.nil?
			ratings = Movie.ratings
		else
			ratings = @ratings.keys
		end

		@all_ratings = Movie.ratings.inject(Hash.new) do |all_ratings, rating|
          all_ratings[rating] = @ratings.nil? ? false : @ratings.has_key?(rating)
          all_ratings
		end

		order_by = params[:sort]
		if order_by == 'title'
			@title_sort = 'hilite'
			@movies = Movie.order(params[:sort]).find_all_by_rating(ratings)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title ASC