app/controllers/movies_controller.rb

  def index
		@all_ratings = Movie.ratings
		order_by = params[:sort]
		if order_by == 'title'
			@title_header = 'hilite'
			@movies = Movie.order(params[:sort])
---
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','PG-13','R')) ORDER BY release_date